2022. 06. 02.

🟡 메모리 할당 함수
   
🟠 꼭 기억해야 할 포인터의 주요 내용

   * 컴퓨터의 모든 메모리에는 주소가 지정되어 있다.
   
   * int aa[3]과 같이 배열을 선언하면 배열 aa는 변수가 아닌 메모리의 주소값 그 자체를 의미한다.
     그리고 이를 포인터 상수라고도 한다.
   
   * 포인터 변수는 주소를 담는 그릇(변수)이고, 포인터 변수를 선언할 때는 int* p 또는 char *p와 같이
     *(asterisk)를 붙여서 선언한다.
     
   * 포인터 변수에는 주소만 대입해야 하는데 이때 변수 앞에 &를 붙인다.
   
 
  #include <stdio.h>

int main(void)
{
	int aa[3];
	int* p;
	int hap = 0;

	for (int i = 0; i < 3; i++)
	{
		printf("%d 번째 숫자 : ", i + 1);
		scanf("%d", &aa[i]);
	}

	p = aa;

	for (int i = 0; i < 3; i++)
	{
		hap = hap + *(p + i);
	}
	printf("합계 : %d", hap);


	return 0;
}


🟠 동적 메모리 확보: malloc()   --> memory allocation

    --> 메모리를 미리 잡아두지 않고 필요할 때마다 메모리를 확복하는 것을 
        '동적 메모리 확보 (dynamic memory allocation)'라고 하며, 이때 사용하는 함수는 malloc()이다.
                         
                         * allocation 뜻 : 배급, 배당
                         
   🔷 동적 메모리 확보의 개념


#include <stdio.h>    

int main(void)
{
	int aa[10000];
	int* p;
	int hap = 0;
	int cnt;

	printf("입력할 개수는? ");
	scanf("%d", &cnt);

	for (int i = 0; i < cnt; i++)
	{
		printf("%2d 번째 숫자 : ", i + 1);
		scanf("%d", &aa[i]);
	}
                                              
	p = aa;

	for (int i = 0; i < cnt; i++)
		hap = hap + *(p + i);

	printf("입력 숫자의 합 ==> %d", hap);

	return 0;
}                         

   🔺🔺 이 코드에는 다음과 같은 문제가 있을 수 있다.
      
       1. 만약 10000개가 넘는 숫자를 더하고 싶을 때는 이 프로그램으로 계산할 수 없다.
       
       2. 더 큰 문제는 메모리의 낭비이다. 이 예에서는 전체 배열 중 겨우 3개만 사용하고 종료했으므로
          사용되지 않은 나머지 9997개의 메모리는 낭비된 것이다. 
          짐을 옮기는 데 10000명이 가서 달랑 3명만 짐을 들고 나머지 9997명은 빈손인 격이다.

   이와 같은 메모리 낭비를 막으려면 필요한 만큼의 메모리를 확보해서 사용해야 한다.
   
   -----------
   
   먼저 더하려는 숫자가 몇 개인지 사용자에게 물어보고 malloc() 함수를 사용하여 메모리를 확보한다.
   만약 사용자가 숫자 3개를 입력하고자 한다면 메모리 세 칸을 확보하고 확보한 주소를 포인터 변수에 넣는다.
   
   포인터 변수 = (포인터 변수의 데이터형*) malloc(포인터 변수의 데이터형 크기 X 필요한 크기)
            p = (int*) malloc(sizeof(int) * 3);

#include <stdio.h>
#include <stdlib.h>  // 또는 malloc.h

int main(void)
{
	int* p;
	int hap = 0;
	int count;

	printf("몇 개의 숫자 입력?? ==> ");
	scanf("%d", &count);

	p = (int*)malloc(sizeof(int) * count);

	for (int i = 0; i < count; i++)
	{
		printf("%d 번쨰 숫자 입력: ", i + 1);
		scanf("%d", &p[i]);   // p+i
		hap = hap + *(p + i);
	}

	printf("합: %d", hap);

	free(p);

	return 0;
}

--------------------------

#include <stdio.h>
#include <stdlib.h>  // 또는 malloc.h

int main(void)
{
	char* pc = NULL;
	int i = 0;

	pc = (char*)malloc(100 * sizeof(char));  // 100개의 문자형이 들어갈 수 있는 공간을 생성 (배열과 비슷한 느낌?)

	if (pc == NULL)
		free(pc);

	for (i = 0; i < 26; i++)
		*(pc + i) = 'a' + i;

	*(pc + i) = 0;

	printf("%s\n", pc);
	free(pc);   // 메모리를 해제해준다. 선택 아닌 필수.

	return 0;
}

--------------------------

#include <stdio.h>
#include <stdlib.h>  // 또는 malloc.h

int main(void)
{
	int* pi = NULL;

	pi = (int*)malloc(5 * sizeof(int));   // 🎈🎈 그냥 malloc(내가 필요한 공간의 크기) 라고 생각하면 될거같다.
             
             /*
                사실
                pi = (int*)malloc(20); 이렇게 써줘도 상관은 없다.
                하지만 초보자 입장에서는 나의 의도를 명확히 표현해주는 것이 중요하다.
                따라서  pi = (int*)malloc(5 * sizeof(int));  이렇게 코드르 짜는 것이 더 바람직하다.
             */
             
	if (pi == NULL)
		free(pi);

	pi[0] = 1;
	pi[1] = 2;
	pi[2] = 3;
	pi[3] = 4;
	pi[4] = 5;

	for (int i = 0; i < 5; i++)
		printf("%d\n", *(p + i));

	free(pi);

	return 0;
}
     ✅ 	Q. pi = (int*)malloc(5 * sizeof(int)); 이 부분에서 (int*)가 뜻하는 건 무엇이지..??
     
          A.  pi = malloc(5 * sizeof(int));  이와 같이 메모리 할당을 하게 되면
              좌측 우측의 자료형이 서로 일치하지 않는다.
              즉, 좌측에 있는 포인터 pi는 int* 자료형이고 malloc 함수는 void* 이기 때문에 서로 다른 자료형이다.
              따라서 두 자료형을 일치시켜야 한다.
              따라서 pi = (int*)malloc(5 * sizeof(int)); 이렇게
              명시적 형 변환을 사용하는 것이 좋다.
              
        🎈🎈  malloc() 함수 앞에 쓴 (int*)를 '캐스트 연산자'라고 한다.   //  캐스트 연산자는 어떠한 자료형을 다른 자료형으로 변환하는 연산자입니다.
              malloc(sizeof(int) * 3)을 수행한 결과로 12바이트를 확보하는데 아직은 이를 어떤 형태로 나눠야 할지 모른다.
              이때 (int*)를 붙여 메모리가 정수형으로 할당되었음을 알려줌으로써 12바이트를 4바이트씩 3개로 잘라서 사용하게 한다.
              만약 (char*)malloc(12)라면 문자형 크기인 1바이트씩 12개로 잘라서 사용한다.
                  
                     
                     
              ✅ Q. 왜 malloc 함수는 void* 반환형을 사용할까??
                  
                  A. malloc 함수는 개발자가 필요한 메모리의 총 크기를 받아서 해당 크기로 메모리를 할당하는 함수이지
                     해당 메모리를 어떤 단위와 구성으로 사용할 것인지는 개발자가 결정하는 것이다.
                     따라서 malloc 함수는 자신이 할당한 메모리가 어떤 단위 또는 어떤 구성으로 사용될지
                     예상할 수 없기 때문에 대상의 크기가 정해져 있지 않다는 뜻의 void*로 주소를 반환하는 것이다.
                     
                                                         출처: https://m.blog.naver.com/PostView.naver?isHttpsRedirect=true&blogId=tipsware&logNo=221325651422
                                                         
     도움 되는 정보: https://codingdog.tistory.com/entry/c%EC%96%B8%EC%96%B4-malloc-%ED%95%A8%EC%88%98-%EB%8F%99%EC%A0%81-%ED%95%A0%EB%8B%B9-%EA%B0%84%EB%8B%A8%ED%95%98%EA%B2%8C-%EC%9D%B4%ED%95%B4%ED%95%B4-%EB%B4%85%EC%8B%9C%EB%8B%A4                                


                                                         
       🔷 그 외 메모리 관련 함수의 활용    
       
 ❗❗❗ calloc(포인터 변수의 데이터형 크기, 필요한 크기)  -->  contiguous allocation    *contiguous 뜻: 인접한, 접촉하는
                                                         
#include <stdio.h>
#include <stdlib.h> 

int main(void)
{
	int* p, * s;
	
	p = (int*)malloc(sizeof(int) * 3);
	s = (int*)calloc(sizeof(int), 3);    <-- calloc() 함수의 사용은 좀 다르다.

	for (int i = 0; i < 3; i++)
		printf("malloc() 함수의 초기값: %d\n", *(p + i));

	printf("\n");

	for (int i = 0; i < 3; i++)
		printf("calloc() 함수의 초기값: %d\n", *(s + i));

	return 0;
}

실행결과: 
          malloc() 함수의 초기값: -842150451
          malloc() 함수의 초기값: -842150451
          malloc() 함수의 초기값: -842150451

          calloc() 함수의 초기값: 0
          calloc() 함수의 초기값: 0
          calloc() 함수의 초기값: 0
                                                         
                                                         
                                                         
 ❗❗❗ (포인터 변수의 데이터형*) realloc(기본 포인터, 포인터 변수의 데이터형 크기 x 필요한 크기);   -->  re-allocation                                                  
                                                         
          --> realloc() 함수는 이미 할당한 공간의 크기를 바꿀 때 사용한다.
                                                         
                                                         
 #include <stdio.h>
#include <stdlib.h> 

int main(void)
{
	int* p;
	int hap = 0;
	int count = 0;
	int data;

	p = (int*)malloc(sizeof(int) * 1);
	printf("1 번째 숫자 : ");
	scanf("%d", p);
	count++;

	for (int i = 2;; i++)
	{
		printf("%d 번째 숫자 : ", i);
		scanf("%d", &data);

		if (data != 0)
			p = (int*)realloc(p, sizeof(int) * i);
		else
			break;

		p[i - 1] = data;
		count++;
	}

	for (int i = 0; i < count; i++)
		hap = hap + *(p + i);

	printf("%d", hap);

	free(p);

	return 0;
}                                                        
                                                         
                                                         
